Revit 2026 API

# IConnectorOrigin Property

---

The location of the connector in family document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
XYZ Origin { get; }
```
```vb
ReadOnly Property Origin As XYZ
	Get
```
```cpp
property XYZ^ Origin {
	XYZ^ get ();
}
```
```fsharp
abstract Origin : XYZ with get
```

#### Property Value

XYZ

This property is used to retrieve the origin of the connector.

#### Reference

IConnector Interface

Autodesk.Revit.DB Namespace